<template>
  <div class="privacy__policy">
    <div class="container">
      <div class="privacy__policy-wrapper">
        <button @click="goToHome" class="privacy__policy-btn">
          <img alt="img" src="./../assets/icon/back.svg" class="privacy__policy-back" >
        </button>
        <div class="privacy__policy-content">
          <h2 class="privacy__policy-top">
            Политика конфиденциальности и обработки персональных данных
          </h2>
          <div class="privacy__policy-text">
            <p>
              Настоящая политика конфиденциальности и обработки персональных данных регулирует порядок обработки и
              использования персональных данных и иных данных сайта ТОО «Time Tracker» (дальше — Администратор).
              Действующая редакция настоящей Политики конфиденциальности, постоянно доступна для ознакомления, и размещена
              в сети Интернет по адресу: https://timetracker.kz Передавая Администратору персональные и иные данные
              посредством Сайта, Пользователь подтверждает свое согласие на использование указанных данных на условиях,
              изложенных в настоящей Политике конфиденциальности. Если Пользователь не согласен с условиями настоящей
              Политики конфиденциальности, он обязан прекратить использование Сайта. Безусловным акцептом настоящей
              Политики конфиденциальности является начало использования Сайта Пользователем. Действующая редакция
              Политики, являющейся публичным документом, разработана Администратором и доступна любому пользователю сети
              Интернет при переходе по гипертекстовой ссылке «Политика конфиденциальности».
            </p>
            <ol class="privacy__policy-list">
              <li>
                <p>1. Термины</p>
                <ol class="privacy__policy-sublist">
                  <li>1.1. Сайт - сайт, расположенный в сети Интернет по адресу https://timetracker.kz. Все исключительные
                    права на Сайт и его отдельные элементы (включая программное обеспечение, дизайн) принадлежат
                    Администратору в полном объеме. Передача исключительных прав Пользователю не является предметом
                    настоящей Политики конфиденциальности.</li>
                  <li>
                    1.2. Пользователь — пользователь Сайта, физическое или юридическое лицо, использующий Форму Обратной
                    Связи
                    на
                    сайте.
                  </li>
                  <li>
                    1.3. Законодательство — действующее законодательство Республики Казахстан.
                  </li>
                  <li>
                    1.4. Персональные данные — персональные данные Пользователя, которые Пользователь предоставляет
                    самостоятельно при заполнении Формы обратной связи или в процессе использования функционала Сайта.
                  </li>
                  <li>1.5. Данные — иные данные о Пользователе (не входящие в понятие Персональных данных).</li>
                  <li>
                    1.6. Форма обратной связи — специальные поля, куда Пользователь вносит персональную информацию, с
                    целью
                    передачи данных о пользователе — Администратору сайта.
                  </li>
                  <li>
                    1.7. Услуга(и) — услуги, предоставляемые Администратором на основании соглашения.
                  </li>
                </ol>
              </li>

              <li>
                <p>2. СБОР И ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ</p>
                <ol class="privacy__policy-sublist">
                  <li>
                    2.1 Администратор собирает и хранит только те Персональные данные, которые необходимы для оказания
                    Услуг Администратором и взаимодействия с Пользователем.
                  </li>
                  <li>
                    <p>
                      2.2 Персональные данные могут использоваться в следующих целях:
                    </p>
                    <ol>
                      <li>2.2.1оказание Услуг Пользователю;</li>
                      <li>
                        2.2.2идентификация Пользователя;
                      </li>
                      <li>
                        2.2.3взаимодействие с Пользователем;
                      </li>
                      <li>
                        2.2.4направление Пользователю рекламных материалов, информации и запросов;
                      </li>
                      <li>
                        2.2.5проведение статистических и иных исследований;
                      </li>
                    </ol>
                  </li>
                  <li>
                    <p>2.3 Администратор в том числе обрабатывает следующие данные:</p>
                    <ol>
                      <li>2.3.1фамилия, имя и отчество;</li>
                      <li>2.3.2номер телефона (в т.ч. мобильного).</li>
                    </ol>
                  </li>
                  <li>
                    2.4Пользователю запрещается указывать на Сайте персональные данные третьих лиц(за исключением условия
                    представления интересов этих лиц, имея документальное подтверждение третьих лиц на осуществление таких
                    действий).
                  </li>
                </ol>
              </li>
              <li>
                <p>3. ПОРЯДОК ОБРАБОТКИ ПЕРСОНАЛЬНЫХ И ИНЫХ ДАННЫХ</p>
                <ol class="privacy__policy-sublist">
                  <li>3.1Администратор обязуется использовать Персональные данные в соответствии с Законом «О персональных
                    данных» Республики Казахстан и внутренними документами Администратора.</li>
                  <li>3.2В отношении Персональных данных и иных Данных Пользователя сохраняется их конфиденциальность,
                    кроме случаев, когда указанные данные являются общедоступными.</li>
                  <li>3.3Администратор имеет право сохранять архивную копию Персональных данных.</li>
                  <li>
                    <p>3.4Администратор имеет право передавать Персональные данные и Данные Пользователя без согласия
                      Пользователя следующим лицам:</p>
                    <ol>
                      <li>3.4.1государственным органам, в том числе органам дознания и следствия, и органам местного
                        самоуправления по их мотивированному запросу;</li>
                      <li>3.4.2в иных случаях, прямо предусмотренных действующим законодательством Республики Казахстан.
                      </li>
                    </ol>
                  </li>
                  <li>
                    <p>3.5Администратор имеет право передавать Персональные данные и Данные третьим лицам, не указанным в
                      п.3.4. настоящей Политики конфиденциальности, в следующих случаях:</p>
                    <ol>
                      <li>3.5.1Пользователь выразил свое согласие на такие действия;</li>
                      <li>3.5.2передача необходима в рамках использования Пользователем Сайта или оказания Услуг
                        Пользователю;</li>
                    </ol>
                  </li>
                  <li>3.6Администратор осуществляет автоматизированную обработку Персональных данных и Данных. </li>
                </ol>
              </li>
              <li>
                <p>4. ЗАЩИТА ПЕРСОНАЛЬНЫХ ДАННЫХ</p>
                <ol class="privacy__policy-sublist">
                  <li>4.1Администратор осуществляет надлежащую защиту Персональных и иных данных в соответствии с
                    Законодательством и принимает необходимые и достаточные организационные и технические меры для защиты
                    Персональных данных.</li>
                  <li>4.2Применяемые меры защиты в том числе позволяют защитить Персональные данные от неправомерного или
                    случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от
                    иных неправомерных действий с ними третьих лиц.</li>
                </ol>
              </li>
              <li>
                <p>5. ИНЫЕ ПОЛОЖЕНИЯ</p>
                <ol class="privacy__policy-sublist">
                  <li>5.1 К настоящей Политике конфиденциальности и отношениям между Пользователем и Администратором,
                    возникающим в связи с применением Политики конфиденциальности, подлежит применению право Республики
                    Казахстан.</li>
                  <li>5.2Если по тем или иным причинам одно или несколько положений Политики конфиденциальности будут
                    признаны недействительными или не имеющими юридической силы, это не оказывает влияния на
                    действительность или применимость остальных положений Политики конфиденциальности.</li>
                  <li>5.3 Администратор имеет право в любой момент изменять Политику конфиденциальности (полностью или в
                    части) в одностороннем порядке без предварительного согласования с Пользователем. Все изменения
                    вступают в силу с момента ее размещения на Сайте.</li>
                  <li>
                    5.4Пользователь обязуется самостоятельно следить за изменениями Политики конфиденциальности путем
                    ознакомления с актуальной редакцией.
                  </li>
                  <li>
                    5.5Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать по
                    электронной почте: <a href="mailto:info@timetracker.kz">info@timetracker.kz</a> или по телефону:
                    <a href="tel:+77007403961">+7 (700) 740 39 61</a>.
                  </li>
                </ol>
              </li>
            </ol>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'PrivacyPolicy',
  methods: {
    goToHome() {
      this.$router.push({ name: 'home' });
    }
  }
}
</script>
<style scoped lang="scss">
.privacy__policy {
  &-back {
    @media(max-width: 550px){
      width: 20px;
    }
  }

  &-btn {
    border-radius: 100%;
    height: 65px;
    display: flex;
    align-items: center;
    justify-content: center;
    background-color: #1475FF;
    min-width: 65px;
    @media(max-width: 550px){
      height: 50px;
      min-width: 50px;
    }
  }
  &-list{
    display: flex;
    flex-direction: column;
    gap: 15px;
    margin-top: 10px;
    &>li>p{
      margin-bottom: 10px;
    }
  }
  &-content {
    color: #FFF;
    display: flex;
    flex-direction: column;
    border-radius: 32px;
    background: #FFF;
    box-shadow: 0px 10px 10px -5px rgba(0, 0, 0, 0.04), 0px 20px 25px -5px rgba(0, 0, 0, 0.10);
  }

  &-text {
    padding: 24px 32px;
    color: #0A0A29;
    font-size: 20px;
    font-weight: 400;
    line-height: 130%;
    @media(max-width: 768px){
      padding: 20px 20px;
      font-size: 16px;
    }
  }
  p, a{
    color: #0A0A29;
    font-size: 20px;
    font-weight: 400;
    line-height: 130%;
    text-decoration: none;
    @media(max-width: 768px){
      font-size: 16px;
    }
  }

  &-wrapper {
    display: flex;
    align-items: flex-start;
    column-gap: 30px;
    @media(max-width: 1023px){
      flex-direction: column;
      row-gap: 30px;
    }
  }

  &-top {
    border-radius: 32px 32px 0px 0px;
    background: #1475FF;
    padding: 32px;
    // font-size: 24px;
    font-style: normal;
    font-weight: 700;
    line-height: 120%;
    
    @media(max-width: 768px){
      padding: 32px 20px;
    }
  }

  ol,
  li {
    list-style-type: none;
  }

}
</style>
  
  
  